#include<stdio.h>
#define VERTEX_MAX 100      //vertex ที่มากที่สุด

int graph[VERTEX_MAX][VERTEX_MAX];      //array 2 มิติ เก็บค่ากราฟ
int copyGraph[VERTEX_MAX][VERTEX_MAX];      //ทำสำเนากราฟ

int numVertex;      //สร้างตัวแปรเก็บจำนวน vertex
int visited[VERTEX_MAX];        //array เอาไว้เก็บค่าการผ่านเส้นทางของ edge
//ฟังก์สร้างการเชื่อมต่อของ edge
void addEdge(int vertex1, int vertex2){    
    graph[vertex1][vertex2] = 1;        //set ค่าในกราฟให้เป็น 1 ขาไป
    graph[vertex2][vertex1] = 1;        // ขากลับ 

    copyGraph[vertex1][vertex2] = 1;        //ทำอีกครั้งสำหรับการทำสำเนากราฟ
    copyGraph[vertex2][vertex1] = 1;        //
}
//ฟังก์ชันปริ้นกราฟ
void printGraph(){
    printf("\nUndirected graph:\n\n");      //กราฟไม่มีทิศทาง
    printf("   ");      //ปริ้นช่องว่าง
    for(int i = 0; i < numVertex; i++){     //ปริ้น column ของกราฟ
        printf("%d ",i);
    }
    printf("\n\n");     //ขึ้นบรรทัดใหม่
    for(int i = 0; i < numVertex; i++){     //ปริ้น vertex ของกราฟ
        printf("%d  ",i);
        for(int j = 0; j < numVertex; j++){     //ปริ้นกราฟ
            printf("%d ",graph[i][j]);
        }
        printf("\n");       //ขี้นบรรทัดใหม่
    }
    printf("\n");       //ขี้นบรรทัดใหม่
}
//ฟังก์ชัน set graph 
void setGraph(){
    for(int i = 0; i < numVertex; i++){
        for(int j = 0; j < numVertex; j++){
            graph[i][j] = 0;        //set ค่ากราฟใน metric ให้เป็น 0
        }
    }
}
//ฟังก์ชันตรวจสอบว่าเคยเดินผ่าน edge นี้แล้วหรือยัง
int dfs(int vertex){
    visited[vertex] = 1;       //ถ้าเดินผ่านแล้วให้ set 1

    for(int i = 0; i < numVertex; i++){
        if(graph[vertex][i] == 1 && !visited[i]){       //เช็คว่าเคยเดินผ่าน edge นี้หรือยัง
            dfs(i);     //ถ้ายังให้เรียกฟังก์ชันซ้ำ
        }
    }
}
//ฟังก์ชันเช็คว่ากราฟเป็นกราฟเชื่อมต่อหรือไม่ 
int isConnected(){    
    int startVertex = 0;       //กำหนดจุดเริ่มต้นของ vertex ในโค้ดนี้กำหนดให้เป็น vertex แรก

     for(int i = 0; i < numVertex; i++){



        visited[i] = 0;     //set ค่าการเดินผ่าน edge เป็น 0 ในเริ่มต้น
    }

    dfs(startVertex);       //เรียกใช้ฟังก์ชัน dfs ส่ง vertex แรก เพื่อตรวจสอบ

    for(int i = 0; i < numVertex; i++){     //เช็คว่าการฟเป็นกราฟเชื่อมต่อหรือไม่
        for(int j = 0; j < numVertex; j++){
            if(graph[i][j] == 1 && !visited[i]){        //ถ้ายังเป็น 0 อยู่แสดงว่ากราฟไม่เชื่อมต่อทุก vertex
                return 0;      //กราฟไม่เชื่อมต่อ คืนค่า0
            }
        }
    }
    return 1;       //กราฟเชื่อมต่อ คืนค่า 1

}
//ฟังก์ชันหาวงจร euler
void eulerCircuit(){
    int currentPath[VERTEX_MAX],topPath = -1;      //stack เก็บเส้นทางปัจจุบัน 👌👌
    int euler[VERTEX_MAX],indexEuler = 0;       //array เก็บวงจร Euler

    int startVertex = 0 ;     //กำหนดจุดเริ่มต้นของ vertex ในโค้ดนี้กำหนดให้เป็น vertex แรก

    currentPath[++topPath] = startVertex;       //ให้ stack เท่ากับ จุดเริ่มต้นของกราฟ
    while(topPath != -1){
        int currentVertex = currentPath[topPath];       //สร้างตัวแปรเก็บ vertex ปัจจุบัน
        int foundEdge = 0;    //ตัวแปรสำหรับเช็คว่าเจอเส้นเชื่อมหรือไม่

        for(int i = 0; i < numVertex; i++){     //สำรวจ edge ที่ยังไม่เดินผ่าน
            if(copyGraph[currentVertex][i] == 1){       //ถ้าเจอ edge ปัจจุบันกับ i

                copyGraph[currentVertex][i] = 0;        //
                copyGraph[i][currentVertex] = 0;        //ทำเครื่องหมายว่า edge นี้มีการเดินผ่านแล้ว หรือลบออกจากกราฟ(set 0)

                currentPath[++topPath] = i;     //เก็บ vertex เข้า stack
                foundEdge = 1;      //เจอเส้นเชื่อม
                break;      //ออกจากลูป
            }
        }

        if(!foundEdge){     //ถ้าไม่เจอเส้นเชื่อมแล้ว
            euler[indexEuler++] = currentVertex;        //เก็บค่า vertex ใน array euler
            topPath--;      //ลดค่า stack ลง 1
        }
    }
    printf("\nEulerian circuit:\n");        //ปริ้นวงจร euler
    for(int i = indexEuler-1; i >= 0; i--){
        printf("%d ",euler[i]);
    }
    printf("\n\n");     //ขึ้นบรรทัดใหม่

}
//ฟังก์ชันตรวจสอบว่าเป็นวงจร euler หรือไม่
int isEuler(){
    int oddDegree = 0;      //ตัวแปรนับดีกรีคี่
    int AllDegree = 0;      //ตัวแปรนับดีกรีทั้งหมด
    for(int i = 0; i < numVertex; i++){
        int DegreeCount = 0;        //ตัวแปรนับดีกรีชั่วคราว
        for(int j = 0; j < numVertex; j++){
            if(graph[i][j] == 1){       //ถ้าเจอเส้นเชื่อม  
                DegreeCount++;      //ให้บวก 1
                AllDegree++;        //
            }
        }
        if(DegreeCount%2 != 0){     //เช็คว่าดีกรีเป็นจำนวนคี่หรือไม่
            // เจอ vertex ที่มีดีกรีคี่
            oddDegree++;        //บวก 1
        }
    }
    if(oddDegree > 0 || AllDegree == 0){        //ถ้ามีดีกรีคี่ หรือ ไม่มีดีกรีเลย
        printf("Euler Graph: No \n\n");       //ไม่เป็นวงจร euler
        return -1;      //คืนค่า -1

    }else{      //ถ้ามีดีกรีเป็นคู่
        printf("Euler Graph: Yes \n\n");      //เป็นวงจร euler
        return AllDegree;       //คืนค่าดีกรีทั้งหมด
    }
}
//ฟังก์ชันหาวงจรย่อย
void subCircuit(int AllDegree){
    if(AllDegree != numVertex*2){       //ถ้าดีกรีทั้งหมดเท่ากับจำนวน vertex*2 ไม่มีวงจรย่อย

        printf("Subcircuit is:\n");    
        int countSub_circuit = 1;       //นับ

        for(int i = 0; i < numVertex; i++){
            int list_vertex[VERTEX_MAX];        //array เก็บvertex
            int index_list = 0;         //index ของ array
            list_vertex[index_list++] = i;       //array เก็บค่า vertex แรก
            for(int j = 0; j < numVertex; j++){
                if(graph[i][j] == 1 && graph[j][i] == 1){       //ถ้าเจอ vertex ที่เชื่อมกัน
                    list_vertex[index_list++] = j;       //ให้ array เก็บค่า column j 
                    graph[i][j] = 0;        //
                    graph[j][i] = 0;        //ทำเครื่องหมายว่าเจอ vertex ที่เชื่อมกันแล้ว set 0 ในกราฟ
                }
            }
            int copy_index = index_list;        //ทำสำเนา index
            for(int k = 0; k < copy_index; k++){        //เช็คว่าใน array มี vertex ที่ยังเชื่อมกันอีกหรือไม่
                int n1 = list_vertex[k];     //n1 เท่ากับ ค่าในarray ตาม index k
                int n2 = list_vertex[k+1];   //n2 เท่ากับ ค่าในarray ตาม index k+1
                if(graph[n1][n2] == 1 && graph[n2][n1] == 1){       //ถ้าเจอ vertex ที่ยังเชื่อมกันอยู่
                    list_vertex[index_list++] = i;       //ให้ array เก็บ vetex แรก ของ array
                    graph[n1][n2] = 0;
                    graph[n2][n1] = 0;      //set ค่าในกราฟ เป็น 0
                }
            }
            if(index_list > 2){     //index_list มากกว่า2ขึ้นไปถึงจะเป็นวงจรย่อย
                for(int h = 0; h < index_list; h++){        //วนลูปปริ้นค่าใน array
                    if(h == 0){
                        printf("Circuit %d: ",countSub_circuit);        //ปริ้นวงจรย่อยที่ X
                    }
                    printf("%d ",list_vertex[h]);        //ปริ้น vertex ของวงจรย่อย
                }printf("\n");      //ขึ้นบรรทัดใหม่
                countSub_circuit++;     //count บวก 1
            }
        }
    }else{      //ไม่มีวงจรย่อยในกราฟ
        printf("Subcircuit not found");
    }
}

void main(){

    // numVertex = 7;      //กำหนดจำนวน Vertex ของกราฟ
    // setGraph();
    // addEdge(0,1);    
    // addEdge(0,2);
    // addEdge(1,2);        //euler
    // addEdge(1,4);
    // addEdge(1,5);
    // addEdge(2,3);
    // addEdge(2,5);
    // addEdge(3,6);
    // addEdge(3,4);
    // addEdge(3,5);
    // addEdge(4,6);
    // addEdge(4,5);

    // numVertex = 5;
    // setGraph();
    // addEdge(0,1);        //euler ภูเขา
    // addEdge(0,2);
    // addEdge(1,2);
    // addEdge(2,3);
    // addEdge(2,4);
    // addEdge(3,4);

    // numVertex = 5;
    // setGraph();
    // addEdge(0,3);        //euler and non subcircuit
    // addEdge(0,4);
    // addEdge(1,2);
    // addEdge(1,3);
    // addEdge(2,4);
    
   
    // numVertex = 6;
    // setGraph();
    // addEdge(0,1);       //non connected
    // addEdge(0,2);
    // addEdge(1,2);
    // addEdge(3,4);
    // addEdge(3,5);
    // addEdge(4,5);

    numVertex = 5;
    setGraph();
    addEdge(0,1);       //non euler
    addEdge(0,2);
    addEdge(4,1);
    addEdge(1,2);
    addEdge(2,3);
    addEdge(3,4);



                                                    // int connect = isConnected();
    if(isConnected()){                              //เรียกใช้ฟังก์ชันเช็คว่ากราฟเป็นกราฟเชื่อมต่อหรือไม่
        printGraph();                        //เรียกฟังก์ชันปริ้นกราฟ
        int euler = isEuler();                       //เรียกใช้ฟังก์ชันตรวจสอบว่าเป็นกราฟ euler หรือไม่
        subCircuit(euler);                              //เรียกใช้ฟังก์ชันหาวงจรย่อยของกราฟ
        if(euler != -1){                         //ถ้าเป็นวงจร euler
            eulerCircuit();                     //เรียกใช้ฟังก์ชันหาวงจร euler
        }
    }else{                                              //ถ้าไม่เป็นกราฟเชื่อมต่อให้ปริ้นข้อความ
        printf("Unconnected Graph!!!\n\n"); 
    }   
}