#include<stdio.h>
#include<stdlib.h>
#include<ctype.h>
#include<math.h>

//โครงสร้างของ node
typedef struct node{
    int value;
    struct node *next;
}node;

node *top = NULL;       //pot ของ stat

node *head_p = NULL;       //head ของ linklist
node *tail_p = NULL;        //หาง

//เพิ่มข้อมูลใน linklist
void append_postfix(int add){             
    node *n = malloc(sizeof(node));     //สร้างโหนด
    n -> next = NULL;                   //ให้ n ชี้ไปที่ NULL
    if(head_p == NULL) head_p = n;      //ถ้า head == NULL ให้ head = n
    else tail_p -> next = n;
    tail_p = n;
    n -> value = add;
}
//ปริ้นpostfixt
void print_postfix(){                   
    node *current = head_p;     //ทำสำเนา head
    while(current != NULL){
        printf("%c",current -> value);      //ปริ้นข้อมูล
        current = current -> next;      //ชี้ไปตัวถัดไป
    }printf("\n");
    
}
//ให้เลื่อน head ไปโหนดถัดไป แล้วลบโหนดเดิมทิ้ง
void shift_head_andDelete(){               
    if(head_p != NULL){     //ตรวจสอบว่า head ไม่เท่ากับค่าว่าง
        node *n = head_p;   //ทำสำเนา head
        head_p = head_p -> next;    //ให้ head  เท่ากับโหนดถัดไป
        free(n);    //ลบโหนดเดิมทิ้ง
    }
}
//ฟังก์ชันรับค่าเข้า stact
void push(int push){            
    node *n = malloc(sizeof(node));     //สร้างโหนดเชื่อมต่อของ stack
    n -> next = top;        //ให้ n ชี้ไปที่ top
    top = n;                
    n -> value = push;      //ให้โหนดเก็บข้อมูล
}
//ฟังก์ชันลบและตือค่าstack ที่อยู่บบนสุดออก
int pop(){
    if(top != NULL){        //ทำเมื่อ top ไม่เท่ากับค่าว่าง
        int pop;
        node *n = top;      //ทำสำเนา top
        top = top -> next;  //top ชี้ไแที่โหนดถัดไป
        pop = n -> value;   //เก็บข้อมูลใน pop
        free(n);            //ลบโหนดบนสุดทิ้ง
        return pop;         //คืนค่าที่เก็บใน pop
    }
    else printf("Stack Empty!!!");      //ถ้า top ไม่มีข้อมูลแล้วให้แสดงข้อความ
}
int count_postfix = 1;      //count ของฟังก์ชัน print_step_postToin()
//ฟังก์ชันปริ้น ค่าในตาราง postfix to infix
void print_step_postToin(char ch){
    node *t = top;               //ทำสำเนา top
    node *h = head_p;           //ทำสำเนา head
    
    printf("%3d%12c%15c",count_postfix++,ch,' ');       //ปริ้นค่าในตาราง
   
    while(t != NULL){
        printf("%d ",t -> value);       //ปริ้นค่า stack
        t = t ->next;
    }
    printf("\n");       //ขึ้นบรรทัดใหม่
}

int count_infix = 1;        ////count ของฟังก์ชัน print_step_postToin()
//ฟังก์ชันปริ้นค่าในตาราง infix to postfix
void print_step_inTopost(char symbol){ //print ทีละ step
    node *t = top;
    node *h = head_p;

    char st[100];       //กำหนดขนาดของ string
    int i = 0;          //index ของ array
    while(t != NULL){   //เปลี่ยนค่า stack จาก char เป็น string
        st[i] = t -> value;
        t = t ->next;
        i++;
    }
    st[i] = '\0';   //สิ้นสุด string
    printf("%3d %12c %16s %13c",count_infix++,symbol,st,' ');       //ปริ้นค่าในตาราง

    while(h != NULL){
        printf("%c",h -> value);        //ปริ้น  output
        h = h -> next;
    }
    printf("\n");       //ขึ้นบรรทัดใหม่
}
//ปริ้นหัวตาราง ของ infix
void print_Headtable_infix(){
    printf("=================================================================\n");
    printf("%-12s%-16s%-16s%-30s\n","Step","Symbol","Stack","Output");
    printf("=================================================================\n");
    
}
//ปริ้นหัวตารางของ postfix
void print_Headtable_postfix(){
    printf("=================================================================\n");
    printf("%-12s%-16s%-16s\n","Step","Symbol","Stack");
    printf("=================================================================\n");
}
//ปริ้นท้ายตาราง
void end_table(){
    printf("=================================================================\n");
}

//ตรวจสอบความสำคัญของ operator
int priority(char p){
    if(p == '^') return 3;                      //ถ้าเท่ากับ ^ ให้คืนค่า 3 
    else if(p == '*' || p == '/') return 2;     //ถ้าเท่ากับ * หรือ / ให้คืนค่า 2
    else if(p == '+' || p == '-') return 1;     //ถ้าเท่ากับ + หรือ - ให้คืนค่า 1
    return 0;                                   //ถ้าไม่เท่ากับ อะไรเลย ให้คืนค่า 0
}

//ฟังก์ชันคำนวณ
int calculate(int top1, int top2, char operator){
    if(operator == '^') return pow(top1,top2);          //คืนค่ายกกำลัง
    else if(operator == '*') return (top1 * top2);      //คืนค่าผลคูณ
    else if(operator == '/') return top2 != 0 ? (top1 / top2) : 0;      //คืนค่าผลหาร ถ้า ตัวหารเป็น0 ให้คืนค่า 0
    else if(operator == '+') return (top1 + top2);      //คืนค่าผลบวก
    else if(operator == '-') return (top1 - top2);      //คืนค่าผลลบ
    return -1;      //ถ้าไม่ใช่ทุกกรณีให้คืนค่า -1
}

//ประมวลผลนิพจน์แบบ postfix ไปเป็นผลลัพธ์
int process_expressions(){
    print_Headtable_postfix();      //เรียกใช้ฟังก์ชันสร้างหังตาราง
    int result = 0;           //กำหนดค่า result = 0 เพื่อใช้เก็บค่าทีแปลงจาก char เป็น int
    char check = 'n';         //เช็คว่า result มีค่าไหม

 
    while(head_p != NULL){              //ทำเมื่อ head ไม่เท่ากับ ค่าว่าง หรือใน linklist ไม่มีข้อมูลแล้ว
        char h_value = head_p -> value;         //กำหนดให้ h_value = ข้ิอมูลใน linklist😵
        char ch;                            //สร้างตัวแปล ไว้รับค่า
        if(h_value != ' '){                 //ตรวจสอบว่า h_value ไม่เท่ากับช่องว่าง
            ch= h_value;
            
        }
        if(isdigit(h_value)){           //ตรวจสอบว่าcharacterเป็นตัวเลขหรือไม่
            result = (result * 10) + (h_value - '0');       //แปลงจากcharacterเป็นinteger
            check = 'y';                 //เช็คว่า result มีเลขมั้ย
        }
        else{
            if(check == 'y'){       //ถ้าcheck == y แสดงว่าresultมีตัวเลขจำนวนเต็มเก็บไว้อยู่ ให้pushลงในstack
                push(result);
                result = 0;         // reset = 0 
                check = 'n';        // reset = n เพื่อทำรอบต่อไป
                print_step_postToin(ch);    //ปริ้นค่าในตาราง postfix to infix
            }
            if(h_value =='^' || h_value == '*' || h_value == '/' || h_value == '+' || h_value =='-'){           //ตรวจสอบว่าเป็น operator หรือไม่
                int top2 = pop();           //top2 เก้บค่าบบนสุดของ stack
                int top1 = pop();           //top1 เก็บค่ารองลงมา
                push(calculate(top1,top2,h_value));         //ส่งค่าไปคำนวนแล้ว เก็บลงใน stack
                print_step_postToin(ch);            //ปริ้นค่าในตาราง postfix to infix
            }
        }
        shift_head_andDelete();        //เลื่อนheadไปที่โหนดถัดไปแล้ว ทำการลบโหนดนั้นทิ้ง
    
    }
    end_table();        //ปริ้นท้ายตาราง
    return pop();       //คืนค่าสุดท้ายใน stack ที่คำนวณเสร็จแล้ว
}

//แปลงนิพจน์แบบ infix เป็น postfix
void infix_to_postfix(char infix[]){
    print_Headtable_infix();        //ปริ้นหัวตารางของ infix

    for(int i = 0; infix[i] != '\0'; i++){      //วงค่าในนิพจ์infix
        char inf = infix[i];             //สร้างตัวแปล inf ไว้รับ cahracter
        
        if(isdigit(inf) || isalpha(inf)) {append_postfix(inf);}      //ถ้าเป็นตัวเลขให้เก็บใน link list

        else if(inf == '(') push(inf);              //ถ้าเป็น ( ให้เก็บในstack

        else if(inf == ')'){                        //ถ้าเป็น ) ให้วนลูปเอาทุกอย่างที่อยู่ในวงเล็บออก
            while(top != NULL && top -> value != '('){  
                append_postfix(pop());          //เก็บใน linklist
            }
            pop();      // pop (
        }
        else if(inf == '^' || inf == '*' || inf == '/' || inf == '+' || inf == '-'){        //ตรวจสอบว่าเป็น operator หรือไม่
            append_postfix(' ');        //เพิ่มช่องว่างเพื่อแยกเลข Ex. 55+5 -> 55 5+

            while(top != NULL && priority(top -> value) >= priority(inf)){      //ตรวจสอบความสำคัญของ operator
                append_postfix(pop());      //ถ้า operator ใน stack มีค่ามากกว่า ตัวที่กำลังตรวจสอบ ให้ pop ออกเก็บไว้ใน linklist
            }
            push(inf);      //ถ้าไม่ใช่ให้ push ใน stack
            
        }
        print_step_inTopost(inf);       //ปริ้นค่าในตาราง infix
    }
    while(top != NULL){append_postfix(pop());}    //เอาค่าที่เหลือใน stack ออกเก็บไว้ใน linklist👍😎😎😎

    print_step_inTopost(' ');           //ปริ้นค่าในตาราง infix
    end_table();        //ปริ้นท้ายตาราง
}

void main(){
    char infix[50];     //กำหนดขนาด string
    printf("Enter infix expressions: ");        //รับค่านิพจน์ infix
    scanf("%s",infix);

    infix_to_postfix(infix);        //ส่งนิพจน์ infix ไปยังฟังก์ชันแปลง infix เป็น postfix
    printf("Postfix = "); print_postfix();      //ปริ้นค่า postfix
    printf("\n");       //ขึ้นบรรทัดใหม่
    
    int result = process_expressions();     //เรียกใช้ฟังก์ชันประมวลผลนิพจน์แบบ postfix ไปเป็นผลลัพธ์
    printf("\nresult = %d",result);     //แสดงผลลัพธ์
}